var CITYS = {
    "北京": ['北京市', '东城区', '西城区', '崇文区', '宣武区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴 区', '怀柔区', '平谷区', '密云县', '延庆县'],
    "天津": ["天津"],
    "上海": ['上海市', '黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '南汇区', '奉贤区', '崇明县'],
    "重庆": ['重庆市', '万州区', '涪陵区', '渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '万盛区', '双桥区', '渝北区', '巴南区', '黔江区', '长寿区', '江津区', '合川区', '永川区', '南川区', '綦江县', '潼南县', '铜梁县', '大足县', '荣昌县', '璧山县', '梁平县', '城口县', '丰都县', '垫江县', '武隆县', '忠县', '开县', '云阳县', '奉节县', '巫山县', '巫溪县', '石柱土家族自治县', '秀山土家族苗族自治县', '酉阳土家族苗族自治县', '彭水苗族土家族自治县'],
    "重庆": ["重庆"],
    "河北": ["石家庄", "张家口", "承德", "秦皇岛", "唐山", "廊坊", "保定", "沧州", "衡水", "邢台", "邯郸", "张北", "蔚县", "丰宁", "围场",
        "怀来", "遵化", "青龙", "坝县", "乐亭", "饶阳", "黄骅", "南宫"
    ],
    "山西": ["太原", "大同", "朔州", "阳泉", "长治", "晋城", "忻州", "晋中", "临汾", "运城", "吕梁", "右玉", "河曲", "五台山", "五寨", "兴县",
        "原平", "离石", "榆社", "隰县", "介休", "候马", "阳城"
    ],
    "陕西": ["西安", "宝鸡", "咸阳", "铜川", "渭南", "延安", "榆林", "汉中", "安康", "商洛"]
};
$(function () {

    $.each(CITYS, function (key, value) {
        var $pro = $("<option>" + key + "</option>");
        $("#province").append($pro);
    });

    $("#province").on('change', function () {
        var proName = $("#province option:selected").text();

        var cities = CITYS[proName]; //  获取CITYS数组的对应value值

        $("#city").empty(); //清空当前city列表

        $.each(cities, function (i, value) {
            var $city = $("<option>" + value + "</option>");
            $("#city").append($city);
        })
    });

    $("#province").triggerHandler('change'); //给一个默认值





})

// 表单数据检验
function checkForm() {
    flag1 = true; //姓名标志
    flag2 = true; //年龄标志
    flag3 = true; //爱好标志

    // 爱好多选框
    var checked = $("input:checked");
    if (checked.length == 0) {
        flag3 = false;
    }

    if (flag3) {
        return true;
    } else {
        alert("请至少选择一个爱好");
        return false;
    }
};